In [20]:
import pandas as pd

values = [10, 20, 30, 40, 50]

s = pd.Series(values, index=['a', 'b', 'c', 'd', 'e'])

df = pd.DataFrame({
    'name': ['Mike', 'Job', 'Alice'],
    'age': [18, 17, 16],
    'job': ['Porgrammer', 'Designer', 'Teacher']
})

df = df.set_index('name')

In [25]:
df1 = pd.DataFrame({
    'a': [1,2,3]
}, index=[0,1,2])

df2 = pd.DataFrame({
    'a': [10,20,30]
}, index=[1,2,0])

In [28]:
df = df.reset_index()

In [29]:
df

    name  age         job
0   Mike   18  Porgrammer
1    Job   17    Designer
2  Alice   16     Teacher

In [33]:
df.to_csv('mydata.csv', index=None)

In [34]:
pd.read_csv('mydata.csv', index_col=0)

       age         job
name
Mike    18  Porgrammer
Job     17    Designer
Alice   16     Teacher

In [35]:
df.to_json('mydata.json')